app/views/index/show.html.erb

		<!-- Ici, on lui demande d'afficher pour chaque gossip, l'auteur + le contenu -->
		<% Gossip.all.each do |gossip| %>
---
SELECT "gossips".* FROM "gossips"

			  		<h3 class="card-title"><%=link_to gossip.title, gossip_path(gossip.id) %> </h3>
			  		<p class="card-text"><%= gossip.user.first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 70], ["LIMIT", 1]]