app/views/gossips/show.html.erb

		  			 <footer class="blockquote-footer text-right">
		  			 	<%= link_to "#{@gossip.user.first_name}", user_path(@gossip.user.id) %><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 76], ["LIMIT", 1]]