app/controllers/gossips_controller.rb

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 71], ["LIMIT", 1]]
---
  def show
  	@id = params[:id]
  	@gossip = Gossip.all.find(@id)

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sarah"], ["content", "fez rg vresgdf"], ["user_id", 70], ["created_at", "2019-08-06 14:05:10.701838"], ["updated_at", "2019-08-06 14:05:10.701838"]]
---
  def create
  	@gossip = Gossip.new(title: params[:title], content: params[:content], user: User.last)

  	if @gossip.save

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 72], ["LIMIT", 1]]
---
  def edit
      @id = params[:id]
      @gossip = Gossip.all.find(@id)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 80], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "user_id" = $3, "updated_at" = $4 WHERE "gossips"."id" = $5  [["title", "End TWO Time"], ["content", "Shante"], ["user_id", 80], ["updated_at", "2019-08-07 10:12:25.000901"], ["id", 72]]
---
  def update
    @gossip = Gossip.find(params[:id])
    if @gossip.update(title: params[:title], content: params[:content], user: User.last)

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 80], ["LIMIT", 1]]
DELETE FROM "gossips" WHERE "gossips"."id" = $1  [["id", 80]]
---
  def destroy


      @gossip = Gossip.all.find(params[:id])
      @gossip.destroy